# Media Company Linear Regression Case Study

#### Problem Statement

- A show had been launched by a digital media corporation (similar to Crunchyroll, Hotstar, Netflix, and others). 
- The show had a positive reception at first, but later saw a drop in viewing.
- The firm wishes to ascertain what went wrong.

### Importing all required packages

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from datetime import datetime
%matplotlib inline

### Importing the dataset

In [2]:
media = pd.read_csv('mediacompany.csv')

 ### Reading the dataset

In [3]:
media.head()

,Date,Views_show,Visitors,Views_platform,Ad_impression,Cricket_match_india,Character_A,Unnamed: 7
0,3/1/2017,183738,1260228,1706478,1060860448,0,0,NaN
1,3/2/2017,193763,1270561,1690727,1031846645,0,0,NaN
2,3/3/2017,210479,1248183,1726157,1010867575,0,0,NaN
3,3/4/2017,240061,1492913,1855353,1079194579,1,0,NaN
4,3/5/2017,446314,1594712,2041418,1357736987,0,0,NaN

### Cleaning the dataset

#### We can drop the last column - <code>Unnamed: 7</code>

In [4]:
media = media.drop('Unnamed: 7',axis = 1)

#### Let's explore the top 5 rows

In [5]:
media.head()

,Date,Views_show,Visitors,Views_platform,Ad_impression,Cricket_match_india,Character_A
0,3/1/2017,183738,1260228,1706478,1060860448,0,0
1,3/2/2017,193763,1270561,1690727,1031846645,0,0
2,3/3/2017,210479,1248183,1726157,1010867575,0,0
3,3/4/2017,240061,1492913,1855353,1079194579,1,0
4,3/5/2017,446314,1594712,2041418,1357736987,0,0

#### Converting date to Pandas datetime format

In [6]:
media['Date'] = pd.to_datetime(media['Date'])
media['Date2'] = datetime(2017, 2, 28) # Taking date since the show started

#### Dataset after cleaning and formatting

In [7]:
media.head()

,Date,Views_show,Visitors,Views_platform,Ad_impression,Cricket_match_india,Character_A,Date2
0,2017-03-01,183738,1260228,1706478,1060860448,0,0,2017-02-28
1,2017-03-02,193763,1270561,1690727,1031846645,0,0,2017-02-28
2,2017-03-03,210479,1248183,1726157,1010867575,0,0,2017-02-28
3,2017-03-04,240061,1492913,1855353,1079194579,1,0,2017-02-28
4,2017-03-05,446314,1594712,2041418,1357736987,0,0,2017-02-28